{
	"name": "MineActivityType",
	"properties": {
		"Name": "MineActivityType",
		"EntityType": "TABLE",
		"Namespace": {
			"DatabaseName": "Mining_wvf"
		},
		"Description": "A mine activity type.\n\nEx:\n- Blasting\n- Blasting Site Preparation\n- Drill\n- Land Backfill Stockpile \n- Load Railcar\n- Load Truck\n- Add Ore To Stockpile\n- Safety Inspection\n- Store Ore\n- Transit Rail To Processing Location\n- Transit Truck To Processing Location\n- Transit Via Conveyer To Processing Location\n- Washing\n- Screening\n- Gravity separation\n- Load product\n- Stacking\n- Dewatering product\n- Dewatering tailing\n- Sampling\n \nwhere:\n\nStacking[edit]\nMain article: Stacker\nTravelling, luffing boom stackers that straddle a feed conveyor are commonly used to create coal stockpiles.\nReclaiming[edit]\nMain article: Reclaimer\nTunnel conveyors can be fed by a continuous slot hopper or bunker beneath the stockpile to reclaim material. Front-end loaders and bulldozers can be used to push the coal into feeders. Sometimes front-end loaders are the only means of reclaiming coal from the stockpile. This has a low up-front capital cost, but much higher operating costs, measured in dollars per tonne handled.\nHigh-capacity stockpiles are commonly reclaimed using bucket-wheel reclaimers. These can achieve very high rates\nCoal sampling[edit]\n\nSampling of coal is an important part of the process control in the CPP. A grab sample is a one-off sample of the coal at a point in the process stream, and tends not to be very representative. A routine sample is taken at a set frequency, either over a period of time or per shipment. Coal sampling consists of several types of sampling devices. A \"cross cut\" sampler mimics the \"stop belt\" sampling method specified by a standard originally published by the American Society for Testing and Materials (ASTM). A cross cut sampler mounts directly on top of the conveyor belt, the falling stream sampler is placed at the head section of the belt. There are several points in the wash plant that many coal operations choose to sample. The raw coal, before it enters the plant. The refuse, to see what the plant missed. Then the clean coal, to see exactly what is being shipped. The sampler is set according to Tons per hour, Feet per minute and top size of the product on the actual belt. A sample is taken then crushed, then sub sampled and returned to the main belt. The sample is sent to an Independent lab for testing where the results will be shared with the buyer as well as the supplier. The buyer in many cases will also sample the coal again once it is received to \"double check\" the results. Continuous measurement of ash, moisture, kCal (BTU), sulfur Fe, Ca, Na, and other element constituents of the coal are reported by cross belt elemental analyzers. This information can be calibrated periodically to the lab data per ASTM methods.\nWashability[edit]\n\nThe washability characteristics of a coal reserve are provided by obtaining liberation data on the raw coal sample. Liberation refers to the amount of physical breakage required to separate material of different material densities. Low density material is clean coal whereas high density material is reject (rock). The intermediate density material is called middlings.\nLiberation data is commonly obtained by float and sink analysis. The procedures for this analysis are detailed in Australian Standard AS 4156.1 - 1994 \"Coal preparation - Higher rank coal - Float and sink testing\".\nCrushing[edit]\n\nCoal crusher plant.\nMain article: Crusher\nCrushing reduces the overall topsize of the ROM coal so that it can be more easily handled and processed within the CPP. Crushing requirements are an important part of CPP design and there are a number of different types.\nScreening[edit]\n\nScreens in screening plant are used to group process particles into ranges by size. These size ranges are also called grades. Dewatering screens are used to remove water from the product. Screens can be static, or mechanically vibrated. Screen decks can be made from different materials such as high tensile steel, stainless steel, or polyethelene.\nGravity separation[edit]\n\nGravity separation methods make use of the different relative densities of different grades of coal, and the reject material.\nJigs[edit]\nJigs are a gravity separation method for coarse coal. Different types of jig include:\nDense medium process[edit]\nDense medium gravity separation methods use a material such as magnetite to form a medium denser than water to assist in separation.\nA cyclone is a conical vessel in which coal along with finely ground magnetite (media) is pumped tangentially to a tapered inlet and short cylindrical section followed by a conical section where the separation takes place. The higher specific gravity fractions being subject to greater centrifugal forces pull away from the central core and descend downwards towards the apex along the wall of cyclone body and pass out as rejects/middlings. The lighter particles are caught in an upward stream and pass out as clean coal through the cyclone overflow outlet via the vortex finder.\nFluid on entry commences in the outer regions of the cyclone body. This combined with rotational motion to which it is constrained creates an outer spiral. The existence of a top central outlet and inability for all the fluid to leave at the cone apex outlet, assist the inward migration of some of the fluid from the external moving mass. The amount of inward migration increases as the apex is neared, i.e. the radius decreased and the fluid which flows in this migratory stream, ultimately reverses its vertical velocity direction and flows upward to the cyclone over flow outlet, i.e. vortex finder. Since it is at the same time rotating, the result is an inner spiral.\nThe Heavy Media Cyclone may be lined with very high quality ceramic tiles or manufactured from Ni-hard (a very hard alloy of cast iron containing nickel) with a specially designed helical profile. A cyclone is the heart of the washing unit in a Heavy Media Washery. It is a non moving part and hence requires very low maintenance. However, the pressure at the inlet of the cyclone is a very important factor and it is suggested to maintain a minimum pressure of around D x 9 x 9.81 x density/100 (in bars), where D = the inner diameter of the cyclone in mm. It is important to note that the pressure at which pulp (mixture of coal and magnetite) is introduced in the cyclone is the principal means of controlling the forces within the cyclone. With the decrease in pressure more coal shall report to the discard/middlings, thus impairing the efficiency of separation.\nIf due to some reason the cyclone feed pump is not being able to deliver the required pressure at the inlet of the cyclone, feed should immediately be stopped and the pipelines, tank and pump should be properly checked for any jamming and any jamming should be properly cleaned before starting the circuit or the feed.\nDense medium baths (DMBs)[edit]\nDifferent types of DMB include:\nTeska bath\nDaniels bath\nLeebar bath\nTromp shallow bath\nDrewboy bath\nBarvoys bath\nChance cone\nWemco drum\nDense medium cyclones[edit]\nA mixture of raw coal and dense medium enters the cyclone at a predetermined flowrate and pressure. A vortex is formed, and the high density reject forced to the outside to the underflow orifice discharge, also called the spigot. The cleaned coal goes longitudinally down the axis of the cylone and leaves the cyclone through the overflow orifice, also called the vortex finder. From the overflow orifice, the coal goes into the overflow chamber, and is discharged to the next stage of the process.\nFine coal methods[edit]\n\nFine coal is cleaned using froth flotation methods. Denver cells and Jameson Cells are two flotation methods used. Spirals perform a simple, low cost and reasonably efficient separation of finer sized material, based on particle density and size.\nDewatering[edit]\n\nDewatering product coal[edit]\nWater is removed from the product to reduce the mass, and runoff on the stockpile. Different methods of dewatering exist, including:\nCoarse coal centrifuges\nScreen bowl centrifuges\nSlurry screens\nDewatering cyclones\nHorizontal belt filters\nDewatering tailings (reject)[edit]\nWater is removed from tailings to recycle water. Filters, centrifuges and thickeners are used in this part of the process. The blackwater which is produced as a by-product is typically placed in a coal slurry impoundment.\nThickeners[edit]\n\nDorr thickener\nThickeners are used for dewatering slurries of either tailings or product. A thickener is a large circular tank that is used to settle out the solid material from the water in the feed slurry. The separated water is clarified and reused as process water in the CPP.\nThickeners are sized according to the volume of feed slurry to be processed. Typical size ranges are from 13 to 40m in diameter and 3-4m high.[1] The floor of the thickener is conical, sloping gently down toward the centre.\nThe feed is pumped into the feedwell, at the centre of the thickener, near the top. The feed is normally dosed with flocculant before delivery to the thickener.\nThe thickened mass is moved toward the bottom centre of the thickener by large rakes that rotate around the tank. Rotation speed is very slow, and drive torques can be high, especially for larger diameter thickeners. Drive torque is usually monitored continuously, as high densities could cause failure of the rakes and drive equipment. Rakes may have the capacity to be raised to reduce drive torque.\nThe thickened slurry, also called thickener underflow, is pumped out of the bottom of the thickener. In the case of product coal, further dewatering is usually required before shipment. Thickened tailings can be pumped to a tailings dam, combined with larger sized rejects for disposal (co-disposal), or dewatered further before disposal.",
		"TableType": "EXTERNAL",
		"Origin": {
			"Type": "SPARK"
		},
		"StorageDescriptor": {
			"Columns": [
				{
					"Name": "MineActivityTypeId",
					"Description": "The unique identifier of a mine activity type.",
					"BaseAttributeReference": {
						"Entity": "MineActivityType.cdm.json/MineActivityType",
						"Name": "MineActivityTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					},
					"DeltaFormatInvalidMessages": []
				},
				{
					"Name": "MineActivityTypeName",
					"Description": "The name of a mine activity type.",
					"BaseAttributeReference": {
						"Entity": "MineActivityType.cdm.json/MineActivityType",
						"Name": "MineActivityTypeName"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 256,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"DeltaFormatInvalidMessages": []
				},
				{
					"Name": "MineActivityTypeDescription",
					"Description": "The description of a mine activity type.",
					"BaseAttributeReference": {
						"Entity": "MineActivityType.cdm.json/MineActivityType",
						"Name": "MineActivityTypeDescription"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"DeltaFormatInvalidMessages": []
				}
			],
			"Format": {
				"InputFormat": "org.apache.hadoop.mapred.SequenceFileInputFormat",
				"OutputFormat": "org.apache.hadoop.hive.ql.io.HiveSequenceFileOutputFormat",
				"FormatType": "csv",
				"SerializeLib": "org.apache.hadoop.hive.serde2.lazy.LazySimpleSerDe",
				"Properties": {
					"path": "abfss://asdasdas@asasasasasasas.dfs.core.windows.net/Mining_wvf/MineActivityType",
					"delimiter": ",",
					"multiLine": "false",
					"firstRowAsHeader": "false",
					"serialization.format": "1",
					"escape": "\\",
					"quote": "\"",
					"FormatTypeSetToDatabaseDefault": true,
					"header": "false"
				}
			},
			"Source": {
				"Provider": "ADLS",
				"Location": "abfss://asdasdas@asasasasasasas.dfs.core.windows.net/Mining_wvf/MineActivityType",
				"Properties": {
					"LinkedServiceName": "testcdm-WorkspaceDefaultStorage",
					"LocationSetToDatabaseDefault": true
				}
			},
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "{\"type\":\"None\",\"level\":\"optimal\"}",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"MineActivityTypeId\":{\"entity\":\"MineActivityType.cdm.json/MineActivityType\",\"name\":\"MineActivityTypeId\"},\"MineActivityTypeName\":{\"entity\":\"MineActivityType.cdm.json/MineActivityType\",\"name\":\"MineActivityTypeName\"},\"MineActivityTypeDescription\":{\"entity\":\"MineActivityType.cdm.json/MineActivityType\",\"name\":\"MineActivityTypeDescription\"}}}"
			},
			"Compressed": false,
			"IsStoredAsSubdirectories": false
		},
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"MineActivityType\",\"path\":\"MineActivityType.cdm.json/MineActivityType\"},\"description\":\"A mine activity type.\\n\\nEx:\\n- Blasting\\n- Blasting Site Preparation\\n- Drill\\n- Land Backfill Stockpile \\n- Load Railcar\\n- Load Truck\\n- Add Ore To Stockpile\\n- Safety Inspection\\n- Store Ore\\n- Transit Rail To Processing Location\\n- Transit Truck To Processing Location\\n- Transit Via Conveyer To Processing Location\\n- Washing\\n- Screening\\n- Gravity separation\\n- Load product\\n- Stacking\\n- Dewatering product\\n- Dewatering tailing\\n- Sampling\\n \\nwhere:\\n\\nStacking[edit]\\nMain article: Stacker\\nTravelling, luffing boom stackers that straddle a feed conveyor are commonly used to create coal stockpiles.\\nReclaiming[edit]\\nMain article: Reclaimer\\nTunnel conveyors can be fed by a continuous slot hopper or bunker beneath the stockpile to reclaim material. Front-end loaders and bulldozers can be used to push the coal into feeders. Sometimes front-end loaders are the only means of reclaiming coal from the stockpile. This has a low up-front capital cost, but much higher operating costs, measured in dollars per tonne handled.\\nHigh-capacity stockpiles are commonly reclaimed using bucket-wheel reclaimers. These can achieve very high rates\\nCoal sampling[edit]\\n\\nSampling of coal is an important part of the process control in the CPP. A grab sample is a one-off sample of the coal at a point in the process stream, and tends not to be very representative. A routine sample is taken at a set frequency, either over a period of time or per shipment. Coal sampling consists of several types of sampling devices. A \\\"cross cut\\\" sampler mimics the \\\"stop belt\\\" sampling method specified by a standard originally published by the American Society for Testing and Materials (ASTM). A cross cut sampler mounts directly on top of the conveyor belt, the falling stream sampler is placed at the head section of the belt. There are several points in the wash plant that many coal operations choose to sample. The raw coal, before it enters the plant. The refuse, to see what the plant missed. Then the clean coal, to see exactly what is being shipped. The sampler is set according to Tons per hour, Feet per minute and top size of the product on the actual belt. A sample is taken then crushed, then sub sampled and returned to the main belt. The sample is sent to an Independent lab for testing where the results will be shared with the buyer as well as the supplier. The buyer in many cases will also sample the coal again once it is received to \\\"double check\\\" the results. Continuous measurement of ash, moisture, kCal (BTU), sulfur Fe, Ca, Na, and other element constituents of the coal are reported by cross belt elemental analyzers. This information can be calibrated periodically to the lab data per ASTM methods.\\nWashability[edit]\\n\\nThe washability characteristics of a coal reserve are provided by obtaining liberation data on the raw coal sample. Liberation refers to the amount of physical breakage required to separate material of different material densities. Low density material is clean coal whereas high density material is reject (rock). The intermediate density material is called middlings.\\nLiberation data is commonly obtained by float and sink analysis. The procedures for this analysis are detailed in Australian Standard AS 4156.1 - 1994 \\\"Coal preparation - Higher rank coal - Float and sink testing\\\".\\nCrushing[edit]\\n\\nCoal crusher plant.\\nMain article: Crusher\\nCrushing reduces the overall topsize of the ROM coal so that it can be more easily handled and processed within the CPP. Crushing requirements are an important part of CPP design and there are a number of different types.\\nScreening[edit]\\n\\nScreens in screening plant are used to group process particles into ranges by size. These size ranges are also called grades. Dewatering screens are used to remove water from the product. Screens can be static, or mechanically vibrated. Screen decks can be made from different materials such as high tensile steel, stainless steel, or polyethelene.\\nGravity separation[edit]\\n\\nGravity separation methods make use of the different relative densities of different grades of coal, and the reject material.\\nJigs[edit]\\nJigs are a gravity separation method for coarse coal. Different types of jig include:\\nDense medium process[edit]\\nDense medium gravity separation methods use a material such as magnetite to form a medium denser than water to assist in separation.\\nA cyclone is a conical vessel in which coal along with finely ground magnetite (media) is pumped tangentially to a tapered inlet and short cylindrical section followed by a conical section where the separation takes place. The higher specific gravity fractions being subject to greater centrifugal forces pull away from the central core and descend downwards towards the apex along the wall of cyclone body and pass out as rejects/middlings. The lighter particles are caught in an upward stream and pass out as clean coal through the cyclone overflow outlet via the vortex finder.\\nFluid on entry commences in the outer regions of the cyclone body. This combined with rotational motion to which it is constrained creates an outer spiral. The existence of a top central outlet and inability for all the fluid to leave at the cone apex outlet, assist the inward migration of some of the fluid from the external moving mass. The amount of inward migration increases as the apex is neared, i.e. the radius decreased and the fluid which flows in this migratory stream, ultimately reverses its vertical velocity direction and flows upward to the cyclone over flow outlet, i.e. vortex finder. Since it is at the same time rotating, the result is an inner spiral.\\nThe Heavy Media Cyclone may be lined with very high quality ceramic tiles or manufactured from Ni-hard (a very hard alloy of cast iron containing nickel) with a specially designed helical profile. A cyclone is the heart of the washing unit in a Heavy Media Washery. It is a non moving part and hence requires very low maintenance. However, the pressure at the inlet of the cyclone is a very important factor and it is suggested to maintain a minimum pressure of around D x 9 x 9.81 x density/100 (in bars), where D = the inner diameter of the cyclone in mm. It is important to note that the pressure at which pulp (mixture of coal and magnetite) is introduced in the cyclone is the principal means of controlling the forces within the cyclone. With the decrease in pressure more coal shall report to the discard/middlings, thus impairing the efficiency of separation.\\nIf due to some reason the cyclone feed pump is not being able to deliver the required pressure at the inlet of the cyclone, feed should immediately be stopped and the pipelines, tank and pump should be properly checked for any jamming and any jamming should be properly cleaned before starting the circuit or the feed.\\nDense medium baths (DMBs)[edit]\\nDifferent types of DMB include:\\nTeska bath\\nDaniels bath\\nLeebar bath\\nTromp shallow bath\\nDrewboy bath\\nBarvoys bath\\nChance cone\\nWemco drum\\nDense medium cyclones[edit]\\nA mixture of raw coal and dense medium enters the cyclone at a predetermined flowrate and pressure. A vortex is formed, and the high density reject forced to the outside to the underflow orifice discharge, also called the spigot. The cleaned coal goes longitudinally down the axis of the cylone and leaves the cyclone through the overflow orifice, also called the vortex finder. From the overflow orifice, the coal goes into the overflow chamber, and is discharged to the next stage of the process.\\nFine coal methods[edit]\\n\\nFine coal is cleaned using froth flotation methods. Denver cells and Jameson Cells are two flotation methods used. Spirals perform a simple, low cost and reasonably efficient separation of finer sized material, based on particle density and size.\\nDewatering[edit]\\n\\nDewatering product coal[edit]\\nWater is removed from the product to reduce the mass, and runoff on the stockpile. Different methods of dewatering exist, including:\\nCoarse coal centrifuges\\nScreen bowl centrifuges\\nSlurry screens\\nDewatering cyclones\\nHorizontal belt filters\\nDewatering tailings (reject)[edit]\\nWater is removed from tailings to recycle water. Filters, centrifuges and thickeners are used in this part of the process. The blackwater which is produced as a by-product is typically placed in a coal slurry impoundment.\\nThickeners[edit]\\n\\nDorr thickener\\nThickeners are used for dewatering slurries of either tailings or product. A thickener is a large circular tank that is used to settle out the solid material from the water in the feed slurry. The separated water is clarified and reused as process water in the CPP.\\nThickeners are sized according to the volume of feed slurry to be processed. Typical size ranges are from 13 to 40m in diameter and 3-4m high.[1] The floor of the thickener is conical, sloping gently down toward the centre.\\nThe feed is pumped into the feedwell, at the centre of the thickener, near the top. The feed is normally dosed with flocculant before delivery to the thickener.\\nThe thickened mass is moved toward the bottom centre of the thickener by large rakes that rotate around the tank. Rotation speed is very slow, and drive torques can be high, especially for larger diameter thickeners. Drive torque is usually monitored continuously, as high densities could cause failure of the rakes and drive equipment. Rakes may have the capacity to be raised to reduce drive torque.\\nThe thickened slurry, also called thickener underflow, is pumped out of the bottom of the thickener. In the case of product coal, further dewatering is usually required before shipment. Thickened tailings can be pumped to a tailings dam, combined with larger sized rejects for disposal (co-disposal), or dewatered further before disposal.\",\"primaryKey\":[\"MineActivityTypeId\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"MineActivityType.cdm.json/MineActivityType\",\"name\":\"MineActivityTypeId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a mine activity type.\",\"isNullable\":false,\"name\":\"MineActivityTypeId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"MineActivityType.cdm.json/MineActivityType\",\"name\":\"MineActivityTypeName\"},\"dataType\":\"string\",\"dataTypeLength\":256,\"description\":\"The name of a mine activity type.\",\"isNullable\":true,\"name\":\"MineActivityTypeName\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"MineActivityType.cdm.json/MineActivityType\",\"name\":\"MineActivityTypeDescription\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"The description of a mine activity type.\",\"isNullable\":true,\"name\":\"MineActivityTypeDescription\"}]}}}",
			"Description": "A mine activity type.\n\nEx:\n- Blasting\n- Blasting Site Preparation\n- Drill\n- Land Backfill Stockpile \n- Load Railcar\n- Load Truck\n- Add Ore To Stockpile\n- Safety Inspection\n- Store Ore\n- Transit Rail To Processing Location\n- Transit Truck To Processing Location\n- Transit Via Conveyer To Processing Location\n- Washing\n- Screening\n- Gravity separation\n- Load product\n- Stacking\n- Dewatering product\n- Dewatering tailing\n- Sampling\n \nwhere:\n\nStacking[edit]\nMain article: Stacker\nTravelling, luffing boom stackers that straddle a feed conveyor are commonly used to create coal stockpiles.\nReclaiming[edit]\nMain article: Reclaimer\nTunnel conveyors can be fed by a continuous slot hopper or bunker beneath the stockpile to reclaim material. Front-end loaders and bulldozers can be used to push the coal into feeders. Sometimes front-end loaders are the only means of reclaiming coal from the stockpile. This has a low up-front capital cost, but much higher operating costs, measured in dollars per tonne handled.\nHigh-capacity stockpiles are commonly reclaimed using bucket-wheel reclaimers. These can achieve very high rates\nCoal sampling[edit]\n\nSampling of coal is an important part of the process control in the CPP. A grab sample is a one-off sample of the coal at a point in the process stream, and tends not to be very representative. A routine sample is taken at a set frequency, either over a period of time or per shipment. Coal sampling consists of several types of sampling devices. A \"cross cut\" sampler mimics the \"stop belt\" sampling method specified by a standard originally published by the American Society for Testing and Materials (ASTM). A cross cut sampler mounts directly on top of the conveyor belt, the falling stream sampler is placed at the head section of the belt. There are several points in the wash plant that many coal operations choose to sample. The raw coal, before it enters the plant. The refuse, to see what the plant missed. Then the clean coal, to see exactly what is being shipped. The sampler is set according to Tons per hour, Feet per minute and top size of the product on the actual belt. A sample is taken then crushed, then sub sampled and returned to the main belt. The sample is sent to an Independent lab for testing where the results will be shared with the buyer as well as the supplier. The buyer in many cases will also sample the coal again once it is received to \"double check\" the results. Continuous measurement of ash, moisture, kCal (BTU), sulfur Fe, Ca, Na, and other element constituents of the coal are reported by cross belt elemental analyzers. This information can be calibrated periodically to the lab data per ASTM methods.\nWashability[edit]\n\nThe washability characteristics of a coal reserve are provided by obtaining liberation data on the raw coal sample. Liberation refers to the amount of physical breakage required to separate material of different material densities. Low density material is clean coal whereas high density material is reject (rock). The intermediate density material is called middlings.\nLiberation data is commonly obtained by float and sink analysis. The procedures for this analysis are detailed in Australian Standard AS 4156.1 - 1994 \"Coal preparation - Higher rank coal - Float and sink testing\".\nCrushing[edit]\n\nCoal crusher plant.\nMain article: Crusher\nCrushing reduces the overall topsize of the ROM coal so that it can be more easily handled and processed within the CPP. Crushing requirements are an important part of CPP design and there are a number of different types.\nScreening[edit]\n\nScreens in screening plant are used to group process particles into ranges by size. These size ranges are also called grades. Dewatering screens are used to remove water from the product. Screens can be static, or mechanically vibrated. Screen decks can be made from different materials such as high tensile steel, stainless steel, or polyethelene.\nGravity separation[edit]\n\nGravity separation methods make use of the different relative densities of different grades of coal, and the reject material.\nJigs[edit]\nJigs are a gravity separation method for coarse coal. Different types of jig include:\nDense medium process[edit]\nDense medium gravity separation methods use a material such as magnetite to form a medium denser than water to assist in separation.\nA cyclone is a conical vessel in which coal along with finely ground magnetite (media) is pumped tangentially to a tapered inlet and short cylindrical section followed by a conical section where the separation takes place. The higher specific gravity fractions being subject to greater centrifugal forces pull away from the central core and descend downwards towards the apex along the wall of cyclone body and pass out as rejects/middlings. The lighter particles are caught in an upward stream and pass out as clean coal through the cyclone overflow outlet via the vortex finder.\nFluid on entry commences in the outer regions of the cyclone body. This combined with rotational motion to which it is constrained creates an outer spiral. The existence of a top central outlet and inability for all the fluid to leave at the cone apex outlet, assist the inward migration of some of the fluid from the external moving mass. The amount of inward migration increases as the apex is neared, i.e. the radius decreased and the fluid which flows in this migratory stream, ultimately reverses its vertical velocity direction and flows upward to the cyclone over flow outlet, i.e. vortex finder. Since it is at the same time rotating, the result is an inner spiral.\nThe Heavy Media Cyclone may be lined with very high quality ceramic tiles or manufactured from Ni-hard (a very hard alloy of cast iron containing nickel) with a specially designed helical profile. A cyclone is the heart of the washing unit in a Heavy Media Washery. It is a non moving part and hence requires very low maintenance. However, the pressure at the inlet of the cyclone is a very important factor and it is suggested to maintain a minimum pressure of around D x 9 x 9.81 x density/100 (in bars), where D = the inner diameter of the cyclone in mm. It is important to note that the pressure at which pulp (mixture of coal and magnetite) is introduced in the cyclone is the principal means of controlling the forces within the cyclone. With the decrease in pressure more coal shall report to the discard/middlings, thus impairing the efficiency of separation.\nIf due to some reason the cyclone feed pump is not being able to deliver the required pressure at the inlet of the cyclone, feed should immediately be stopped and the pipelines, tank and pump should be properly checked for any jamming and any jamming should be properly cleaned before starting the circuit or the feed.\nDense medium baths (DMBs)[edit]\nDifferent types of DMB include:\nTeska bath\nDaniels bath\nLeebar bath\nTromp shallow bath\nDrewboy bath\nBarvoys bath\nChance cone\nWemco drum\nDense medium cyclones[edit]\nA mixture of raw coal and dense medium enters the cyclone at a predetermined flowrate and pressure. A vortex is formed, and the high density reject forced to the outside to the underflow orifice discharge, also called the spigot. The cleaned coal goes longitudinally down the axis of the cylone and leaves the cyclone through the overflow orifice, also called the vortex finder. From the overflow orifice, the coal goes into the overflow chamber, and is discharged to the next stage of the process.\nFine coal methods[edit]\n\nFine coal is cleaned using froth flotation methods. Denver cells and Jameson Cells are two flotation methods used. Spirals perform a simple, low cost and reasonably efficient separation of finer sized material, based on particle density and size.\nDewatering[edit]\n\nDewatering product coal[edit]\nWater is removed from the product to reduce the mass, and runoff on the stockpile. Different methods of dewatering exist, including:\nCoarse coal centrifuges\nScreen bowl centrifuges\nSlurry screens\nDewatering cyclones\nHorizontal belt filters\nDewatering tailings (reject)[edit]\nWater is removed from tailings to recycle water. Filters, centrifuges and thickeners are used in this part of the process. The blackwater which is produced as a by-product is typically placed in a coal slurry impoundment.\nThickeners[edit]\n\nDorr thickener\nThickeners are used for dewatering slurries of either tailings or product. A thickener is a large circular tank that is used to settle out the solid material from the water in the feed slurry. The separated water is clarified and reused as process water in the CPP.\nThickeners are sized according to the volume of feed slurry to be processed. Typical size ranges are from 13 to 40m in diameter and 3-4m high.[1] The floor of the thickener is conical, sloping gently down toward the centre.\nThe feed is pumped into the feedwell, at the centre of the thickener, near the top. The feed is normally dosed with flocculant before delivery to the thickener.\nThe thickened mass is moved toward the bottom centre of the thickener by large rakes that rotate around the tank. Rotation speed is very slow, and drive torques can be high, especially for larger diameter thickeners. Drive torque is usually monitored continuously, as high densities could cause failure of the rakes and drive equipment. Rakes may have the capacity to be raised to reduce drive torque.\nThe thickened slurry, also called thickener underflow, is pumped out of the bottom of the thickener. In the case of product coal, further dewatering is usually required before shipment. Thickened tailings can be pumped to a tailings dam, combined with larger sized rejects for disposal (co-disposal), or dewatered further before disposal.",
			"DisplayFolderInfo": "{\"name\":\"Mining\",\"colorCode\":\"#7D0F6C\"}",
			"PrimaryKeys": "MineActivityTypeId",
			"spark.sql.sources.provider": "csv",
			"sql:IsAppendOnly": false
		},
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false
	},
	"type": "TABLE"
}